onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Нетология_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Нетология_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Нетология_Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	///Изменение Конфигупаций Нетология
	//Вызов процедуры добавление элементов на форму
	ИзмНетология_ДобавитьЭлементыФормНаСервере();
	//Конец Изменение Конфигупаций Нетология
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//Измененый код	
  ////КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
  ////ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
//	Конец измененого кода
	
	/////////// Изменение Конфигупаций Нетология
	//Перерасчет суммы в зависимости от скидки 
	СуммаСкидки = Объект.Нетология_Скидка + ТекущиеДанные.Скидка ;
	Если СуммаСкидки > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Сумма скидок не может быть больше 100% ";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		ТекущиеДанные.Сумма = 0;
	Иначе
		Скидка = ТекущиеДанные.Цена * СуммаСкидки / 100;
		ТекущиеДанные.Сумма = (ТекущиеДанные.Цена - Скидка) * ТекущиеДанные.Количество;	 
	КонецЕсли;
	РассчитатьСуммуДокумента();
///////////Конец Изменение Конфигураций Нетология
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ИзменениеКонфигурацийНетология 
////////Изменени конфигураций Нетология
////////Задача №1 20.02.2024
///////Добавление элементов форм на документ ЗаказРокупателя.Поле с реквизитом Нетология_Скидка и командой Нетология_Скидка
///////Изменение расссчета суммы с учетом согласованной скидки.
///////Конец Задача №1
///////Конец  Изменени конфигураций Нетология
&НаСервере
Процедура ИзмНетология_ДобавитьЭлементыФормНаСервере();
        /////////// Изменение Конфигураций Нетология
		///Добавление элементов на форму
	  ГруппаСкидка = Элементы.Добавить("ГруппаШапкаСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
		ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСкидка.Заголовок = "";
		ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		ГруппаСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаСкидка.РастягиватьПоГоризонтали = ИСТИНА;
	  
	    ПолеВводаСкидка = Элементы.Добавить("Нетология_Скидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаСкидка);
		ПолеВводаСкидка.Заголовок = "Согласованная скидка";	
		ПолеВводаСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСкидка.ПутьКДанным = "Объект.Нетология_Скидка";
        ПолеВводаСкидка.УстановитьДействие("ПриИзменении", "ИзмНетология_ПерерасчетСуммыПосле");
	  	
	   /////Конец Изменение Конфигупаций Нетология
   КонецПроцедуры
   
   &НаКлиенте
 Асинх Процедура ИзмНетология_ПерерасчетСуммыПосле() Экспорт
	/////////// Изменение Конфигураций Нетология 
	////////////Проверка табличной части
	Если Объект.Товары.Количество() > 0 ИЛИ  Объект.Услуги.Количество() > 0 Тогда 
		//////////Подтверждение действия
		ОбещаниеВопрос = ВопросАсинх("Вполнить перерасчет суммы документа?",РежимДиалогаВопрос.ДаНет, , , ,КодВозвратаДиалога.Да);
		Результат = Ждать ОбещаниеВопрос;
		Если Результат = КодВозвратаДиалога.Да Тогда
			///////////////////////Вызов процедуры рассчета сккидки
			Для Каждого СтрокаДанные Из Объект.Товары Цикл
				РассчитатьСуммуСтроки(СтрокаДанные);	
			КонецЦикла;
			
			Для Каждого СтрокаДанные Из Объект.Услуги Цикл
				РассчитатьСуммуСтроки(СтрокаДанные);	
			КонецЦикла;
			
		КонецЕсли;	
	Иначе 	
		ОбещаниеПредупреждение = ПредупреждениеАсинх("Выберите номенклатуру!!!", ,);
		Результат = Ждать ОбещаниеВопрос;	
	КонецЕсли;	
	///////////Конец Изменение Конфигураций Нетология
КонецПроцедуры    
   
#КонецОбласти
